Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: # /detection
ja: use Mojolicious::Lite;

source: # /hello/test
ja: use Mojolicious::Lite;

source: # A helper to identify visitors
ja: # 訪問者を特定するヘルパー

source: # Access request information
ja: # リクエストの情報にアクセス

source: # Access session data in action and template
ja: # アクションとテンプレートの中のセッションデータへのアクセス

source: # Admin section
ja: # Adminの部分

source: # Authenticate based on name parameter
ja: # nameパラメータを元にした認証

source: # Authenticated
ja: # 認証された

source: # Blocking
ja: # ブロッキング

source: # Check file size
ja: # ファイルサイズのチェック

source: # Concurrent non-blocking
ja: # 並列のノンブロッキング

source: # Disable detection and allow the following routes to re-enable it on demand
ja: # 検出を無効にして、以降のルートにおいて必要であれば再び有効にする

source: # Display message
ja: # メッセージを表示する

source: # Echo the request body and send custom header with response
ja: # リクエストボディをエコーして、レスポンスのついたカスタムヘッダを送信

source: # Event loop
ja: # イベントループ

source: # GET /hello
ja: # "hello.html.ep"というテンプレートを描画

source: # Global logic shared by all routes
ja: # すべてのルートで共有されるグローバルなロジック

source: # HTML/XML DOM parser with CSS selectors
ja: # CSSセレクタ付きHTML/XML DOMパーサー

source: # HTTP/WebSocket server
ja: # HTTP/WebSocket サーバ

source: # HTTP/WebSocket user agent
ja: # HTTP/WebSocket ユーザエージェント

source: # Increase limit to 1GiB
ja: # 制限を1GBに増やす

source: # Load message into memory
ja: # メッセージをメモリに読み込む

source: # Local logic shared only by routes in this group
ja: # グループ内のルートだけに共有されるローカルなロジック

source: # Modify the received JSON document and return it
ja: # 受け取ったJSONドキュメントを変更して返す

source: # Multipart upload handler
ja: # Multipartのアップロードのハンドラ

source: # Non-blocking
ja: # ノンブロッキング

source: # Not authenticated
ja: # 認証されなかった

source: # Only reached when authenticated
ja: # / (with authentication)

source: # Perl-ish templates
ja: # Perl風テンプレート

source: # Prepare mode specific message during startup
ja: # startupの間にモードに合ったメッセージを準備する

source: # Process uploaded file
ja: # アップロードしたファイルを処理

source: # Render template "templates/foo/bar.html.ep"
ja: # "templates/foo/bar.html.ep"というテンプレートを描画する

source: # Render the template "hello.html.ep"
ja: # "hello.html.ep"というテンプレートを描画

source: # Render the template "index.html.ep"
ja: # "index.html.ep"というテンプレートを描画

source: # Route leading to an action that renders a template
ja: # テンプレートを描画するアクションに至るルート

source: # Route leading to an action that renders some text
ja: # テキストをレンダリングするアクションへのルーティング

source: # Start the "daemon" command
ja: # "daemon"コマンドを開始する

source: # Upload form in DATA section
ja: # DATAセクションのformをアップロード

source: # Use @ARGV to pick a command
ja: # @ARGVを使ってコマンドを取得する

source: # Use helper in action and template
ja: # アクションとテンプレートのなかでヘルパーを使う

source: $ ./myapp.pl daemon -l http://*:8080
ja: $ ./myapp.pl daemon --listen http://*:8080

source: $hash->{msg} = "echo: $hash->{msg}";
ja: my ($self, $hash) = @_;

source: ...List of available commands (or automatically detected environment)...
ja: ...利用可能なコマンドが表示(または自動的に環境が検知される)...

source: <%= link_to Hello => 'hello' %>.
ja: __DATA__;

source: =cut
ja: =head1 参考 [[Mojolicious]], L<Mojolicious::Guides>, L<http://mojolicio.us>. (2019/03/16 Mojolicious 8.12) =cut

source: =head1 DESCRIPTION
ja: =head1 説明

source: =head1 MORE
ja: =head1 もっと

source: =head1 NAME
ja: =head1 名前

source: =head1 SEE ALSO
ja: =head1 参考

source: =head1 SUPPORT
ja: =head1 サポート

source: =head1 SYNOPSIS
ja: =head1 使い方

source: =head1 TUTORIAL
ja: =head1 チュートリアル

source: =head2 Blocks
ja: =head2 ブロック

source: =head2 Built-in C<exception> and C<not_found> pages
ja: =head2 組み込みの例外(C<exception>)とノットファウンド(C<not_found>)ページ

source: =head2 Commands
ja: =head2 コマンド

source: =head2 Conditions
ja: =head2 条件

source: =head2 Content negotiation
ja: =head2 コンテントネゴシエーション

source: =head2 Extending L<Test::Mojo>
ja: =head2 Extending [[Test::Mojo]]

source: =head2 External templates
ja: =head2 外部テンプレート

source: =head2 File uploads
ja: =head2 ファイルアップロード

source: =head2 Formats
ja: =head2 フォーマット

source: =head2 GET/POST parameters
ja: =head2 GET/POSTパラメーター

source: =head2 HTTP methods
ja: =head2 HTTPメソッド

source: =head2 Helpers
ja: =head2 ヘルパー

source: =head2 Home
ja: =head2 ホーム

source: =head2 L<Test::Mojo> at a glance
ja: =head2 [[Test::Mojo]] at a glance

source: =head2 Layouts
ja: =head2 レイアウト

source: =head2 Mode
ja: =head2 モード

source: =head2 Optional placeholders
ja: =head2 プレースホルダーのオプション

source: =head2 Placeholders
ja: =head2 プレースホルダー

source: =head2 Relaxed Placeholders
ja: =head2 リラックスプレースホルダー

source: =head2 Reloading
ja: =head2 リロード

source: =head2 Restrictive placeholders
ja: =head2 制約的なプレースホルダー

source: =head2 Route names
ja: =head2 ルーティング名

source: =head2 Routes
ja: =head2 ルーティング(Routes)

source: =head2 Sessions
ja: =head2 セッション

source: =head2 Stash and templates
ja: =head2 スタッシュとテンプレート

source: =head2 Static files
ja: =head2 静的ファイル

source: =head2 Testing
ja: =head2 テスト

source: =head2 The L<Test::Mojo> object
ja: =head2 The [[Test::Mojo]] object

source: =head2 Under
ja: =head2 アンダー (Under)

source: =head2 User agent
ja: =head2 ユーザーエージェント

source: =head2 WebSockets
ja: =head2 WebSocket

source: =head2 Wildcard placeholders
ja: =head2 ワイルドカードプレースホルダー

source: =item * B<When we disagree, try to understand why.> Disagreements, both social and technical, happen all the time and L<Mojolicious> is no exception.
ja: =item * B<When we disagree, try to understand why.> Disagreements, both social and technical, happen all the time and [[Mojolicious]] is no exception.

source: =item * L<Mojo::Asset::File>
ja: =item * [[Mojo::Asset::File]]

source: =item * L<Mojo::Asset::Memory>
ja: =item * [[Mojo::Asset::Memory]]

source: =item * L<Mojo::Asset>
ja: =item * [[Mojo::Asset]]

source: =item * L<Mojo::Base>
ja: =item * [[Mojo::Base]]

source: =item * L<Mojo::ByteStream>
ja: =item * [[Mojo::ByteStream]]

source: =item * L<Mojo::Cache>
ja: =item * [[Mojo::Cache]]

source: =item * L<Mojo::Collection>
ja: =item * [[Mojo::Collection]]

source: =item * L<Mojo::Content::MultiPart>
ja: =item * [[Mojo::Content::MultiPart]]

source: =item * L<Mojo::Content::Single>
ja: =item * [[Mojo::Content::Single]]

source: =item * L<Mojo::Content>
ja: =item * [[Mojo::Content]]

source: =item * L<Mojo::Cookie::Request>
ja: =item * [[Mojo::Cookie::Request]]

source: =item * L<Mojo::Cookie::Response>
ja: =item * [[Mojo::Cookie::Response]]

source: =item * L<Mojo::Cookie>
ja: =item * [[Mojo::Cookie]]

source: =item * L<Mojo::DOM::CSS>
ja: =item * [[Mojo::DOM::CSS]]

source: =item * L<Mojo::DOM::HTML>
ja: =item * [[Mojo::DOM::HTML]]

source: =item * L<Mojo::DOM>
ja: =item * [[Mojo::DOM]]

source: =item * L<Mojo::Date>
ja: =item * [[Mojo::Date]]

source: =item * L<Mojo::DynamicMethods>
ja: =item * [[Mojo::DynamicMethods]]

source: =item * L<Mojo::EventEmitter>
ja: =item * [[Mojo::EventEmitter]]

source: =item * L<Mojo::Exception>
ja: =item * [[Mojo::Exception]]

source: =item * L<Mojo::File>
ja: =item * [[Mojo::File]]

source: =item * L<Mojo::Headers>
ja: =item * [[Mojo::Headers]]

source: =item * L<Mojo::HelloWorld>
ja: =item * [[Mojo::HelloWorld]]

source: =item * L<Mojo::Home>
ja: =item * [[Mojo::Home]]

source: =item * L<Mojo::IOLoop::Client>
ja: =item * [[Mojo::IOLoop::Client]]

source: =item * L<Mojo::IOLoop::Delay>
ja: =item * [[Mojo::IOLoop::Delay]]

source: =item * L<Mojo::IOLoop::Server>
ja: =item * [[Mojo::IOLoop::Server]]

source: =item * L<Mojo::IOLoop::Stream>
ja: =item * [[Mojo::IOLoop::Stream]]

source: =item * L<Mojo::IOLoop::Subprocess>
ja: =item * [[Mojo::IOLoop::Subprocess]]

source: =item * L<Mojo::IOLoop::TLS>
ja: =item * [[Mojo::IOLoop::TLS]]

source: =item * L<Mojo::IOLoop>
ja: =item * [[Mojo::IOLoop]]

source: =item * L<Mojo::JSON::Pointer>
ja: =item * [[Mojo::JSON::Pointer]]

source: =item * L<Mojo::JSON>
ja: =item * [[Mojo::JSON]]

source: =item * L<Mojo::Loader>
ja: =item * [[Mojo::Loader]]

source: =item * L<Mojo::Log>
ja: =item * [[Mojo::Log]]

source: =item * L<Mojo::Message::Request>
ja: =item * [[Mojo::Message::Request]]

source: =item * L<Mojo::Message::Response>
ja: =item * [[Mojo::Message::Response]]

source: =item * L<Mojo::Message>
ja: =item * [[Mojo::Message]]

source: =item * L<Mojo::Parameters>
ja: =item * [[Mojo::Parameters]]

source: =item * L<Mojo::Path>
ja: =item * [[Mojo::Path]]

source: =item * L<Mojo::Promise>
ja: =item * [[Mojo::Promise]]

source: =item * L<Mojo::Reactor::EV>
ja: =item * [[Mojo::Reactor::EV]]

source: =item * L<Mojo::Reactor::Poll>
ja: =item * [[Mojo::Reactor::Poll]]

source: =item * L<Mojo::Reactor>
ja: =item * [[Mojo::Reactor]]

source: =item * L<Mojo::Server::CGI>
ja: =item * [[Mojo::Server::CGI]]

source: =item * L<Mojo::Server::Daemon>
ja: =item * [[Mojo::Server::Daemon]]

source: =item * L<Mojo::Server::Hypnotoad>
ja: =item * [[Mojo::Server::Hypnotoad]]

source: =item * L<Mojo::Server::Morbo::Backend::Poll>
ja: =item * [[Mojo::Server::Morbo::Backend::Poll]]

source: =item * L<Mojo::Server::Morbo::Backend>
ja: =item * [[Mojo::Server::Morbo::Backend]]

source: =item * L<Mojo::Server::Morbo>
ja: =item * [[Mojo::Server::Morbo]]

source: =item * L<Mojo::Server::PSGI>
ja: =item * [[Mojo::Server::PSGI]]

source: =item * L<Mojo::Server::Prefork>
ja: =item * [[Mojo::Server::Prefork]]

source: =item * L<Mojo::Server>
ja: =item * [[Mojo::Server]]

source: =item * L<Mojo::Template>
ja: =item * [[Mojo::Template]]

source: =item * L<Mojo::Transaction::HTTP>
ja: =item * [[Mojo::Transaction::HTTP]]

source: =item * L<Mojo::Transaction::WebSocket>
ja: =item * [[Mojo::Transaction::WebSocket]]

source: =item * L<Mojo::Transaction>
ja: =item * [[Mojo::Transaction]]

source: =item * L<Mojo::URL>
ja: =item * [[Mojo::URL]]

source: =item * L<Mojo::Upload>
ja: =item * [[Mojo::Upload]]

source: =item * L<Mojo::UserAgent::CookieJar>
ja: =item * [[Mojo::UserAgent::CookieJar]]

source: =item * L<Mojo::UserAgent::Proxy>
ja: =item * [[Mojo::UserAgent::Proxy]]

source: =item * L<Mojo::UserAgent::Server>
ja: =item * [[Mojo::UserAgent::Server]]

source: =item * L<Mojo::UserAgent::Transactor>
ja: =item * [[Mojo::UserAgent::Transactor]]

source: =item * L<Mojo::UserAgent>
ja: =item * [[Mojo::UserAgent]]

source: =item * L<Mojo::Util>
ja: =item * [[Mojo::Util]]

source: =item * L<Mojo::WebSocket>
ja: =item * [[Mojo::WebSocket]]

source: =item * L<Mojo>
ja: =item * [[Mojo]]

source: =item * L<Mojolicious::Command::Author::cpanify>
ja: =item * [[Mojolicious::Command::Author::cpanify]]

source: =item * L<Mojolicious::Command::Author::generate::app>
ja: =item * [[Mojolicious::Command::Author::generate::app]]

source: =item * L<Mojolicious::Command::Author::generate::lite_app>
ja: =item * [[Mojolicious::Command::Author::generate::lite_app]]

source: =item * L<Mojolicious::Command::Author::generate::makefile>
ja: =item * [[Mojolicious::Command::Author::generate::makefile]]

source: =item * L<Mojolicious::Command::Author::generate::plugin>
ja: =item * [[Mojolicious::Command::Author::generate::plugin]]

source: =item * L<Mojolicious::Command::Author::generate>
ja: =item * [[Mojolicious::Command::Author::generate]]

source: =item * L<Mojolicious::Command::Author::inflate>
ja: =item * [[Mojolicious::Command::Author::inflate]]

source: =item * L<Mojolicious::Command::cgi>
ja: =item * [[Mojolicious::Command::cgi]]

source: =item * L<Mojolicious::Command::daemon>
ja: =item * [[Mojolicious::Command::daemon]]

source: =item * L<Mojolicious::Command::eval>
ja: =item * [[Mojolicious::Command::eval]]

source: =item * L<Mojolicious::Command::get>
ja: =item * [[Mojolicious::Command::get]]

source: =item * L<Mojolicious::Command::prefork>
ja: =item * [[Mojolicious::Command::prefork]]

source: =item * L<Mojolicious::Command::psgi>
ja: =item * [[Mojolicious::Command::psgi]]

source: =item * L<Mojolicious::Command::routes>
ja: =item * [[Mojolicious::Command::routes]]

source: =item * L<Mojolicious::Command::version>
ja: =item * [[Mojolicious::Command::version]]

source: =item * L<Mojolicious::Command>
ja: =item * [[Mojolicious::Command]]

source: =item * L<Mojolicious::Commands>
ja: =item * [[Mojolicious::Commands]]

source: =item * L<Mojolicious::Controller>
ja: =item * [[Mojolicious::Controller]]

source: =item * L<Mojolicious::Lite>
ja: =item * [[Mojolicious::Lite]]

source: =item * L<Mojolicious::Plugin::Config>
ja: =item * [[Mojolicious::Plugin::Config]]

source: =item * L<Mojolicious::Plugin::DefaultHelpers>
ja: =item * [[Mojolicious::Plugin::DefaultHelpers]]

source: =item * L<Mojolicious::Plugin::EPLRenderer>
ja: =item * [[Mojolicious::Plugin::EPLRenderer]]

source: =item * L<Mojolicious::Plugin::EPRenderer>
ja: =item * [[Mojolicious::Plugin::EPRenderer]]

source: =item * L<Mojolicious::Plugin::HeaderCondition>
ja: =item * [[Mojolicious::Plugin::HeaderCondition]]

source: =item * L<Mojolicious::Plugin::JSONConfig>
ja: =item * [[Mojolicious::Plugin::JSONConfig]]

source: =item * L<Mojolicious::Plugin::Mount>
ja: =item * [[Mojolicious::Plugin::Mount]]

source: =item * L<Mojolicious::Plugin::TagHelpers>
ja: =item * [[Mojolicious::Plugin::TagHelpers]]

source: =item * L<Mojolicious::Plugin>
ja: =item * [[Mojolicious::Plugin]]

source: =item * L<Mojolicious::Plugins>
ja: =item * [[Mojolicious::Plugins]]

source: =item * L<Mojolicious::Renderer>
ja: =item * [[Mojolicious::Renderer]]

source: =item * L<Mojolicious::Routes::Match>
ja: =item * [[Mojolicious::Routes::Match]]

source: =item * L<Mojolicious::Routes::Pattern>
ja: =item * [[Mojolicious::Routes::Pattern]]

source: =item * L<Mojolicious::Routes::Route>
ja: =item * [[Mojolicious::Routes::Route]]

source: =item * L<Mojolicious::Routes>
ja: =item * [[Mojolicious::Routes]]

source: =item * L<Mojolicious::Sessions>
ja: =item * [[Mojolicious::Sessions]]

source: =item * L<Mojolicious::Static>
ja: =item * [[Mojolicious::Static]]

source: =item * L<Mojolicious::Types>
ja: =item * [[Mojolicious::Types]]

source: =item * L<Mojolicious::Validator::Validation>
ja: =item * [[Mojolicious::Validator::Validation]]

source: =item * L<Mojolicious::Validator>
ja: =item * [[Mojolicious::Validator]]

source: =item * L<Mojolicious>
ja: =item * [[Mojolicious]]

source: =item * L<Test::Mojo>
ja: =item * [[Test::Mojo]]

source: =item * L<ojo>
ja: =item * [[ojo]]

source: =item L<Minion>
ja: =item [[Minion]]

source: =item L<Mojo::DOM>
ja: =item [[Mojo::DOM]]

source: =item L<Mojo::IOLoop>
ja: =item [[Mojo::IOLoop]]

source: =item L<Mojo::JSON>
ja: =item [[Mojo::JSON]]

source: =item L<Mojo::Pg>
ja: =item [[Mojo::Pg]]

source: =item L<Mojo::Server::CGI>, L<Mojo::Server::PSGI>
ja: =item [[Mojo::Server::CGI]], [[Mojo::Server::PSGI]]

source: =item L<Mojo::Server::Daemon>
ja: =item [[Mojo::Server::Daemon]]

source: =item L<Mojo::Server::Prefork>
ja: =item [[Mojo::Server::Prefork]]

source: =item L<Mojo::Template>
ja: =item [[Mojo::Template]]

source: =item L<Mojo::UserAgent>
ja: =item [[Mojo::UserAgent]]

source: =item L<Mojolicious::Guides::Contributing>
ja: =item [[Mojolicious::Guides::Contributing]]

source: =item L<Mojolicious::Guides::Cookbook>
ja: =item [[Mojolicious::Guides::Cookbook]]

source: =item L<Mojolicious::Guides::FAQ>
ja: =item [[Mojolicious::Guides::FAQ]]

source: =item L<Mojolicious::Guides::Growing>
ja: =item [[Mojolicious::Guides::Growing]]

source: =item L<Mojolicious::Guides::Rendering>
ja: =item [[Mojolicious::Guides::Rendering]]

source: =item L<Mojolicious::Guides::Routing>
ja: =item [[Mojolicious::Guides::Routing]]

source: =item L<Mojolicious::Guides::Testing>
ja: =item [[Mojolicious::Guides::Testing]]

source: =item L<Mojolicious::Guides::Tutorial>
ja: =item [[Mojolicious::Guides::Tutorial]]

source: =item L<Mojolicious::Plugin::Config>
ja: =item [[Mojolicious::Plugin::Config]]

source: =item L<Mojolicious::Plugin::DefaultHelpers>
ja: =item [[Mojolicious::Plugin::DefaultHelpers]]

source: =item L<Mojolicious::Plugin::EPLRenderer>
ja: =item [[Mojolicious::Plugin::EPLRenderer]]

source: =item L<Mojolicious::Plugin::EPRenderer>
ja: =item [[Mojolicious::Plugin::EPRenderer]]

source: =item L<Mojolicious::Plugin::HeaderCondition>
ja: =item [[Mojolicious::Plugin::HeaderCondition]]

source: =item L<Mojolicious::Plugin::JSONConfig>
ja: =item [[Mojolicious::Plugin::JSONConfig]]

source: =item L<Mojolicious::Plugin::Mount>
ja: =item [[Mojolicious::Plugin::Mount]]

source: =item L<Mojolicious::Plugin::TagHelpers>
ja: =item [[Mojolicious::Plugin::TagHelpers]]

source: =item L<Test::Mojo>
ja: =item [[Test::Mojo]]

source: =item L<ojo>
ja: =item [[ojo]]

source: @@ counter.html.ep
ja: __DATA__;

source: @@ denied.html.ep
ja: __DATA__;

source: @@ groovy.html.ep
ja: __DATA__;

source: @@ index.html.ep
ja: __DATA__;

source: A default configuration filename in the application home directory will be generated from the value of L<Mojolicious/"moniker"> (C<$moniker.json>).
ja: A default configuration filename in the application home directory will be generated from the value of [[Mojolicious/"moniker"]] (C<$moniker.json>).

source: A C<format> value can also be passed to L<Mojolicious::Controller/"url_for">.
ja: A C<format> value can also be passed to [[Mojolicious::Controller/"url_for">.

source: A call to L<Mojolicious/"start"> (C<app-E<gt>start>), which starts the command system, should be the last expression in your application, because its return value can be significant.
ja: [[Mojolicious]]のC<start> (C<app-E<gt>start>)を呼び出すと、コマンドシステムが開始されます。この呼び出しはアプリケーションの最後に置くべきです。というのは、返り値が大きな影響をもつ場合があるからです。

source: A callback used to decide if a cookie should be ignored by L</"collect">.
ja: A callback used to decide if a cookie should be ignored by [[/"collect"]].

source: A callback used to deserialize sessions, defaults to L<Mojo::JSON/"j">.
ja: A callback used to deserialize sessions, defaults to [[Mojo::JSON/"j"]].

source: A callback used to deserialize subprocess return values, defaults to using L<Storable>.
ja: A callback used to deserialize subprocess return values, defaults to using [[Storable]].

source: A callback used to escape the results of escaped expressions, defaults to L<Mojo::Util/"xml_escape">.
ja: A callback used to escape the results of escaped expressions, defaults to [[Mojo::Util/"xml_escape"]].

source: A callback used to serialize sessions, defaults to L<Mojo::JSON/"encode_json">.
ja: A callback used to serialize sessions, defaults to [[Mojo::JSON/"encode_json"]].

source: A callback used to serialize subprocess return values, defaults to using L<Storable>.
ja: A callback used to serialize subprocess return values, defaults to using [[Storable]].

source: A default configuration filename in the application home directory will be generated from the value of L<Mojolicious/"moniker"> (C<$moniker.conf>).
ja: A default configuration filename in the application home directory will be generated from the value of [[Mojolicious/"moniker"]] (C<$moniker.conf>).

source: A default subscriber that turns all errors into warnings will usually be added by L<Mojo::IOLoop> as a fallback.
ja: A default subscriber that turns all errors into warnings will usually be added by [[Mojo::IOLoop]] as a fallback.

source: A fast and fun way to get started developing web applications with L<Mojolicious>.
ja: A fast and fun way to get started developing web applications with [[Mojolicious]].

source: A few stash values like C<template>, C<text> and C<data> are reserved and will be used by L<Mojolicious::Controller/"render"> to decide how a response should be generated.
ja: テンプレートはC<DATA>セクションに埋め込むことができます。C<template>、C<text>、C<data>などのいくつかがスタッシュの値として予約されており、[[Mojolicious::Controller]]のC<render>で使われて、レスポンスをどのように生成するかが決定されます。

source: A full featured HTTP user agent for use in your applications, defaults to a L<Mojo::UserAgent> object.
ja: A full featured HTTP user agent for use in your applications, defaults to a [[Mojo::UserAgent]] object.

source: A full featured job queue for L<Mojolicious> with support for multiple backends (such as L<PostgreSQL|http://www.postgresql.org>).
ja: A full featured job queue for [[Mojolicious]] with support for multiple backends (such as [[PostgreSQL|http://www.postgresql.org]]).

source: A fundamental concept of the L<Mojolicious> router is that extracted placeholder values are turned into a hash.
ja: A fundamental concept of the [[Mojolicious]] router is that extracted placeholder values are turned into a hash.

source: A good rule of thumb is two worker processes per CPU core for applications that perform mostly non-blocking operations, blocking operations often require more and benefit from decreasing concurrency with L<Mojo::Server::Daemon/"clients"> (often as low as C<1>).
ja: A good rule of thumb is two worker processes per CPU core for applications that perform mostly non-blocking operations, blocking operations often require more and benefit from decreasing concurrency with [[Mojo::Server::Daemon/"clients"]] (often as low as C<1>).

source: A good rule of thumb is two worker processes per CPU core for applications that perform mostly non-blocking operations, blocking operations often require more and benefit from decreasing concurrency with L</"clients"> (often as low as C<1>).
ja: A good rule of thumb is two worker processes per CPU core for applications that perform mostly non-blocking operations, blocking operations often require more and benefit from decreasing concurrency with [[/"clients"]] (often as low as C<1>).

source: A list of all built-in helpers can be found in L<Mojolicious::Plugin::DefaultHelpers> and L<Mojolicious::Plugin::TagHelpers>.
ja: A list of all built-in helpers can be found in [[Mojolicious::Plugin::DefaultHelpers]] and [[Mojolicious::Plugin::TagHelpers]].

source: A list of all built-in ones can be found in L<Mojolicious::Plugin::DefaultHelpers> and L<Mojolicious::Plugin::TagHelpers>.
ja: すべての組み込みヘルパーのリストは、 [[Mojolicious::Plugin::DefaultHelpers]] と [[Mojolicious::Plugin::TagHelpers]]にあります。

source: A lot more documentation and examples by many different authors can be found in the L<Mojolicious wiki|http://github.com/mojolicious/mojo/wiki>.
ja: A lot more documentation and examples by many different authors can be found in the [[Mojolicious wiki|http://github.com/mojolicious/mojo/wiki]].

source: A minimal embeddable application is nothing more than a subclass of L<Mojolicious>, containing a C<handler> method accepting L<Mojolicious::Controller> objects.
ja: A minimal embeddable application is nothing more than a subclass of [[Mojolicious]], containing a C<handler> method accepting [[Mojolicious::Controller]] objects.

source: A mode other than C<development> will raise the log level from C<debug> to C<info>.
ja: C<development>以外のモードでは、ログレベルがC<debug>からC<info>に上がります。

source: A powerful web development toolkit, with all the basic tools and helpers needed to write simple web applications and higher level web frameworks, such as L<Mojolicious>.
ja: シンプルなWebアプリケーションや[[Mojolicious]] などの高レベルのWebフレームワークを書くために必要なすべての基本的なツールとヘルパーを備えた強力なWeb開発ツールキット。

source: A quick example-driven introduction to the wonders of L<Mojolicious::Lite>.
ja: [[Mojolicious::Lite]]の特徴を簡単なサンプルで紹介していきます。

source: A reference back to the application that dispatched to this controller, usually a L<Mojolicious> object.
ja: A reference back to the application that dispatched to this controller, usually a [[Mojolicious]] object.

source: A simple Hello World application can look like this, L<strict>, L<warnings>, L and Perl 5.10 L<features|feature> are automatically enabled and a few L<functions|Mojolicious::Lite/"FUNCTIONS"> imported, when you use L<Mojolicious::Lite>, turning your script into a full featured web application.
ja: かんたんなHello Worldアプリケーションはこのようになります。C<strict>, C<warnings>, C 、Perl 5.10のC<features|feature> が自動的に有効になり、 [[Mojolicious::Lite]]のC<functions> がいくつかインポートされます。 [[Mojolicious::Lite]]を使うと、あなたのスクリプトは完全な機能を備えたウェブアプリケーションになります。
